Revit.Elements.SunSettings.StartDateTime
Gets the Start Date and Time of the solar study given in the local time of the solar study location.

Revit.Elements.SunSettings.EndDateTime
Gets the End Date and Time of the solar study given in the local time of the solar study location.

Revit.Elements.SunSettings.CurrentDateTime
Gets the Date and Time for the current frame of the solar study given in the local time of the solar study location.

Revit.Elements.SunSettings.TranslateTime(System.DateTime)
Fix for: http://adsk-oss.myjetbrains.com/youtrack/issue/MAGN-8993
StartDateAndTime, EndDateAndTime and ActiveFrameTime should return local datetime,
that is set in Revit project configuration.
But it returns customized datetime + user timezone offset, which is incorrect.
Althought in documentation it's said,
that "The output value will be in Coordinated Universal Time (UTC),
but input may be in local time as well."
There is no means to return local time.